"IOConnectionReceptaclePort" = "端口";
"IOConnectionReceptacleSlot" = "插槽";
"IOConnectionReceptacleBay"  = "仓位";
"IOConnectionReceptacleJack" = "插孔";

"IOConnectionPositionTop"      = "顶部";
"IOConnectionPositionUpper"    = "上方";
"IOConnectionPositionBottom"   = "底部";
"IOConnectionPositionLower"    = "下方";
"IOConnectionPositionLeft"     = "左边";
"IOConnectionPositionRight"    = "右边";
"IOConnectionPositionFront"    = "前面";
"IOConnectionPositionBack"     = "背面";
"IOConnectionPositionExternal" = "外置";
"IOConnectionPositionInternal" = "内置";
"IOConnectionPositionBuiltIn"  = "内建";

"IOConnectionMultipleParents" = "已连接多个设备";

/* Order used to build strings is always: Vendor, DeviceName, DeviceClass,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatDeviceName"                  = "%1$@";
"IODescriptionFormatDeviceClass"                 = "%1$@";
"IODescriptionFormatVendorDeviceName"            = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceClass"           = "%1$@ %2$@";
"IODescriptionFormatDeviceNameDeviceClass"       = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceNameDeviceClass" = "%1$@ %2$@ %3$@";

/* Order used to build strings is always: Position, Kind, Receptacle, Index,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatConnectionKind"                        = "%1$@";
"IODescriptionFormatConnectionKindIndex"                   = "%1$@ %2$@";
"IODescriptionFormatConnectionReceptacle"                  = "%1$@";
"IODescriptionFormatConnectionReceptacleIndex"             = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacle"              = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacleIndex"         = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKind"                = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionKindIndex"           = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionReceptacle"          = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionReceptacleIndex"     = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacle"      = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacleIndex" = "%1$@ %2$@ %3$@ %4$@";

"IODescriptionFormatCombinedNameConnection"      = "%1$@, %2$@";
"IODescriptionFormatCombinedNameMultipleParents" = "%1$@（%2$@）";

"IODescriptionFormatCombinedMultipleParents" = "设备已连接多个设备";

"IODescriptionDelimiter" = " -> ";
